Attiny2313/SCARA-Robot-Controler-BT/src/main.cpp
#include <Arduino.h>
#include <Bluepad32.h>
#include <FastAccelStepper.h>
#include <ESP32Servo.h>

// ============================================================
// PINY
// ============================================================

constexpr uint8_t PIN_LED_BT       = 4;
constexpr uint8_t PIN_LED_ERROR    = 16;
constexpr uint8_t PIN_LED_STATUS   = 17;

constexpr uint8_t PIN_STEP_ARM1    = 13;
constexpr uint8_t PIN_DIR_ARM1     = 26;

constexpr uint8_t PIN_STEP_ARM2    = 23;
constexpr uint8_t PIN_DIR_ARM2     = 14;

constexpr uint8_t PIN_STEP_Z       = 18;
constexpr uint8_t PIN_DIR_Z        = 19;

constexpr uint8_t PIN_SERVO_ROTATE = 27;
constexpr uint8_t PIN_SERVO_GRIP   = 32;

constexpr uint8_t PIN_BUTTON_TEACH = 25;
constexpr uint8_t PIN_BUTTON_MODE  = 33;

constexpr uint8_t PIN_ESTOP        = 39;

// Przewidziane na później:
constexpr uint8_t PIN_ENDSTOP_Z    = 34;
constexpr uint8_t PIN_ENDSTOP_ARM1 = 35;
constexpr uint8_t PIN_ENDSTOP_ARM2 = 36;

// ============================================================
// KONFIGURACJA MECHANIKI
// WARTOŚCI KONIECZNIE DOSTOSUJ DO SWOJEGO ROBOTA
// ============================================================

// Długości ramion od osi obrotu do osi obrotu [mm].
constexpr float ARM_LENGTH_1_MM = 91.61f;
constexpr float ARM_LENGTH_2_MM = 97.528f;

// Silnik 200 kroków/obrót, mikrokrok 1/16:
constexpr float MOTOR_STEPS_REV = 200.0f;
constexpr float MICROSTEPS      = 16.0f;

// Przełożenia: obrót silnika / obrót osi.
// Przykład: koło silnika 16T i koło osi 80T => 80/16 = 5.
constexpr float GEAR_ARM1 = 3.875f;
constexpr float GEAR_ARM2 = 7.280f;

// Śruba osi Z: 2 mm na obrót.
constexpr float Z_SCREW_LEAD_MM = 2.0f;
constexpr float GEAR_Z          = 1.0f;

// Odwrócenie kierunku osi.
// Zmień na -1, jeśli dana oś jedzie przeciwnie.
constexpr int8_t SIGN_ARM1 = 1;
constexpr int8_t SIGN_ARM2 = 1;
constexpr int8_t SIGN_Z    = 1;

constexpr float STEPS_PER_DEG_ARM1 =
    MOTOR_STEPS_REV * MICROSTEPS * GEAR_ARM1 / 360.0f;

constexpr float STEPS_PER_DEG_ARM2 =
    MOTOR_STEPS_REV * MICROSTEPS * GEAR_ARM2 / 360.0f;

constexpr float STEPS_PER_MM_Z =
    MOTOR_STEPS_REV * MICROSTEPS * GEAR_Z / Z_SCREW_LEAD_MM;

// ============================================================
// POZYCJA DOMOWA PO WŁĄCZENIU
// ============================================================

// Program zakłada, że po załączeniu zasilania robot naprawdę znajduje się
// dokładnie w tej pozycji.
constexpr float HOME_ARM1_DEG = 115.0f;  //sprawdzić znak
constexpr float HOME_ARM2_DEG = -147.0f; //sprawdzić znak
constexpr float HOME_Z_MM     = 0.0f;

constexpr float HOME_TOOL_ROTATE_DEG = 90.0f;
constexpr float HOME_GRIP_DEG        = 30.0f;

// ============================================================
// OGRANICZENIA PROGRAMOWE
// ============================================================

constexpr float ARM1_MIN_DEG = -115.0f;
constexpr float ARM1_MAX_DEG =  115.0f;

constexpr float ARM2_MIN_DEG = -147.0f;
constexpr float ARM2_MAX_DEG =  147.0f;

constexpr float Z_MIN_MM = 0.0f;
constexpr float Z_MAX_MM = 300.0f;

constexpr float TOOL_ROTATE_MIN_DEG = 0.0f;
constexpr float TOOL_ROTATE_MAX_DEG = 180.0f;

constexpr float GRIP_MIN_DEG = 15.0f;
constexpr float GRIP_MAX_DEG = 95.0f;

// ============================================================
// PRĘDKOŚCI
// ============================================================

// Tryb JOINT:
constexpr float ARM_JOG_SPEED_DEG_S = 25.0f;
constexpr float Z_JOG_SPEED_MM_S    = 15.0f;

// Tryb TOOL:
constexpr float TOOL_XY_SPEED_MM_S  = 60.0f;

// Serwa - maksymalna prędkość zadawania pozycji:
constexpr float TOOL_ROTATE_SPEED_DEG_S = 35.0f;
constexpr float GRIP_SPEED_DEG_S        = 45.0f;

// Zakres impulsów serw. W razie potrzeby skalibruj osobno każde serwo.
constexpr int SERVO_ROTATE_MIN_US = 500;
constexpr int SERVO_ROTATE_MAX_US = 2500;
constexpr int SERVO_GRIP_MIN_US   = 500;
constexpr int SERVO_GRIP_MAX_US   = 2500;

// Wygładzanie pozycji. 0 = brak ruchu, 1 = natychmiastowa zmiana.
// Dla okresu 20 ms wartości 0.15-0.30 zwykle dają płynny ruch.
constexpr float SERVO_FILTER_ALPHA = 0.20f;

// Maksymalne częstotliwości STEP:
constexpr uint32_t ARM1_MAX_STEP_HZ = 10000;
constexpr uint32_t ARM2_MAX_STEP_HZ = 10000;
constexpr uint32_t Z_MAX_STEP_HZ    = 12000;

// Przyspieszenie w krokach/s²:
constexpr uint32_t ARM1_ACCEL = 12000;
constexpr uint32_t ARM2_ACCEL = 12000;
constexpr uint32_t Z_ACCEL    = 15000;

// ============================================================
// CZASY
// ============================================================

constexpr uint32_t CONTROL_PERIOD_MS = 10;
constexpr uint32_t SERVO_PERIOD_MS = 20;
constexpr uint32_t GAMEPAD_TIMEOUT_MS = 500;
constexpr int16_t JOYSTICK_DEADZONE = 90;

// ============================================================
// STRUKTURY
// ============================================================

enum class ControlMode : uint8_t {
    JOINT,
    TOOL
};

struct JointPosition {
    float arm1Deg;
    float arm2Deg;
    float zMm;
};

struct CartesianPosition {
    float xMm;
    float yMm;
    float zMm;
};

struct RobotState {
    JointPosition joints;
    CartesianPosition tcp;

    float toolRotateDeg;
    float gripperDeg;

    ControlMode mode;

    bool estopLatched;
    bool controllerConnected;
};

// ============================================================
// OBIEKTY
// ============================================================

FastAccelStepperEngine stepperEngine;

FastAccelStepper* stepperArm1 = nullptr;
FastAccelStepper* stepperArm2 = nullptr;
FastAccelStepper* stepperZ    = nullptr;

Servo servoRotate;
Servo servoGrip;

ControllerPtr controllers[BP32_MAX_GAMEPADS];

RobotState robot;

// ============================================================
// ZMIENNE CZASOWE
// ============================================================

uint32_t lastControlMs = 0;
uint32_t lastServoUpdateMs = 0;
uint32_t lastGamepadPacketMs = 0;

float servoRotateFilteredDeg = HOME_TOOL_ROTATE_DEG;
float servoGripFilteredDeg = HOME_GRIP_DEG;

bool previousModeButton = HIGH;
bool previousTeachButton = HIGH;
bool previousPadStart = false;

