Attiny2313/SCARA-Robot-Controler-BT/src/main.cpp
// ============================================================
// FUNKCJE POMOCNICZE
// ============================================================

float clampFloat(float value, float minimum, float maximum) {
    if (value < minimum) {
        return minimum;
    }

    if (value > maximum) {
        return maximum;
    }

    return value;
}

float degToRad(float degrees) {
    return degrees * PI / 180.0f;
}

float radToDeg(float radians) {
    return radians * 180.0f / PI;
}

float normalizeJoystick(int32_t value) {
    if (abs(value) < JOYSTICK_DEADZONE) {
        return 0.0f;
    }

    constexpr float maximumAxisValue = 512.0f;

    float normalized = static_cast<float>(value) / maximumAxisValue;
    return clampFloat(normalized, -1.0f, 1.0f);
}

int32_t arm1DegreesToSteps(float angleDeg) {
    return lroundf(angleDeg * STEPS_PER_DEG_ARM1 * SIGN_ARM1);
}

int32_t arm2DegreesToSteps(float angleDeg) {
    return lroundf(angleDeg * STEPS_PER_DEG_ARM2 * SIGN_ARM2);
}

int32_t zMillimetersToSteps(float zMm) {
    return lroundf(zMm * STEPS_PER_MM_Z * SIGN_Z);
}

float arm1StepsToDegrees(int32_t steps) {
    return static_cast<float>(steps) /
           (STEPS_PER_DEG_ARM1 * SIGN_ARM1);
}

float arm2StepsToDegrees(int32_t steps) {
    return static_cast<float>(steps) /
           (STEPS_PER_DEG_ARM2 * SIGN_ARM2);
}

float zStepsToMillimeters(int32_t steps) {
    return static_cast<float>(steps) /
           (STEPS_PER_MM_Z * SIGN_Z);
}

// ============================================================
// KINEMATYKA PROSTA
// ============================================================

CartesianPosition forwardKinematics(const JointPosition& joints) {
    const float theta1 = degToRad(joints.arm1Deg);
    const float theta2 = degToRad(joints.arm2Deg);

    CartesianPosition result;

    result.xMm =
        ARM_LENGTH_1_MM * cosf(theta1) +
        ARM_LENGTH_2_MM * cosf(theta1 + theta2);

    result.yMm =
        ARM_LENGTH_1_MM * sinf(theta1) +
        ARM_LENGTH_2_MM * sinf(theta1 + theta2);

    result.zMm = joints.zMm;

    return result;
}

// ============================================================
// KINEMATYKA ODWROTNA
// ============================================================

bool inverseKinematics(
    float xMm,
    float yMm,
    bool elbowUp,
    JointPosition& result
) {
    const float radiusSquared = xMm * xMm + yMm * yMm;

    float cosTheta2 =
        (radiusSquared -
         ARM_LENGTH_1_MM * ARM_LENGTH_1_MM -
         ARM_LENGTH_2_MM * ARM_LENGTH_2_MM) /
        (2.0f * ARM_LENGTH_1_MM * ARM_LENGTH_2_MM);

    if (cosTheta2 < -1.0f || cosTheta2 > 1.0f) {
        return false;
    }

    cosTheta2 = clampFloat(cosTheta2, -1.0f, 1.0f);

    float sinTheta2 = sqrtf(1.0f - cosTheta2 * cosTheta2);

    if (!elbowUp) {
        sinTheta2 = -sinTheta2;
    }

    const float theta2 = atan2f(sinTheta2, cosTheta2);

    const float theta1 =
        atan2f(yMm, xMm) -
        atan2f(
            ARM_LENGTH_2_MM * sinTheta2,
            ARM_LENGTH_1_MM +
                ARM_LENGTH_2_MM * cosTheta2
        );

    result.arm1Deg = radToDeg(theta1);
    result.arm2Deg = radToDeg(theta2);
    result.zMm = robot.joints.zMm;

    if (result.arm1Deg < ARM1_MIN_DEG ||
        result.arm1Deg > ARM1_MAX_DEG ||
        result.arm2Deg < ARM2_MIN_DEG ||
        result.arm2Deg > ARM2_MAX_DEG) {
        return false;
    }

    return true;
}

// ============================================================
// STEROWANIE SILNIKAMI
// ============================================================

void commandJointPosition(const JointPosition& target) {
    if (robot.estopLatched) {
        return;
    }

    const float arm1 =
        clampFloat(target.arm1Deg, ARM1_MIN_DEG, ARM1_MAX_DEG);

    const float arm2 =
        clampFloat(target.arm2Deg, ARM2_MIN_DEG, ARM2_MAX_DEG);

    const float z =
        clampFloat(target.zMm, Z_MIN_MM, Z_MAX_MM);

    stepperArm1->moveTo(arm1DegreesToSteps(arm1));
    stepperArm2->moveTo(arm2DegreesToSteps(arm2));
    stepperZ->moveTo(zMillimetersToSteps(z));

    robot.joints.arm1Deg = arm1;
    robot.joints.arm2Deg = arm2;
    robot.joints.zMm = z;

    robot.tcp = forwardKinematics(robot.joints);
}

void emergencyStopMotion() {
    if (stepperArm1 != nullptr) {
        stepperArm1->forceStop();
    }

    if (stepperArm2 != nullptr) {
        stepperArm2->forceStop();
    }

    if (stepperZ != nullptr) {
        stepperZ->forceStop();
    }
}

// ============================================================
// E-STOP
// ============================================================

void updateEmergencyStop() {
    // Założenie:
    // styk NC zwiera wejście do GND podczas prawidłowej pracy,
    // a po naciśnięciu E-STOP wejście przechodzi w HIGH
    // przez zewnętrzny rezystor pull-up.
    const bool estopActive = digitalRead(PIN_ESTOP) == HIGH;

    if (estopActive && !robot.estopLatched) {     
        robot.estopLatched = true;

        emergencyStopMotion();

        digitalWrite(PIN_LED_ERROR, HIGH);
        digitalWrite(PIN_LED_STATUS, LOW);

        Serial.println("E-STOP AKTYWNY");
    }
}

// ============================================================
// TRYB STEROWANIA
// ============================================================

void toggleControlMode() {
    if (robot.estopLatched) {
        return;
    }

    if (robot.mode == ControlMode::JOINT) {
        robot.mode = ControlMode::TOOL;
        Serial.println("Tryb: TOOL");
    } else {
        robot.mode = ControlMode::JOINT;
        Serial.println("Tryb: JOINT");
    }

    digitalWrite(
        PIN_LED_STATUS,
        robot.mode == ControlMode::TOOL ? HIGH : LOW
    );
}

void printCurrentPosition() {
    Serial.println();
    Serial.println("----- POZYCJA ROBOTA -----");

    Serial.printf(
        "Ramię 1: %.2f deg\n",
        robot.joints.arm1Deg
    );

    Serial.printf(
        "Ramię 2: %.2f deg\n",
        robot.joints.arm2Deg
    );

    Serial.printf(
        "Z: %.2f mm\n",
        robot.joints.zMm
    );

    Serial.printf(
        "TCP X: %.2f mm\n",
        robot.tcp.xMm
    );

    Serial.printf(
        "TCP Y: %.2f mm\n",
        robot.tcp.yMm
    );

    Serial.printf(
        "Obrót chwytaka: %.1f deg\n",
        robot.toolRotateDeg
    );

    Serial.printf(
        "Chwytak: %.1f deg\n",
        robot.gripperDeg
    );

    Serial.println("--------------------------");
}

