Attiny2313/SCARA-Robot-Controler-BT/src/main.cpp
// ============================================================
// PRZYCISKI NA PCB
// ============================================================

void updatePanelButtons() {
    const bool modeButton = digitalRead(PIN_BUTTON_MODE);
    const bool teachButton = digitalRead(PIN_BUTTON_TEACH);

    if (previousModeButton == HIGH && modeButton == LOW) {
        toggleControlMode();
    }

    if (previousTeachButton == HIGH && teachButton == LOW) {
        printCurrentPosition();
    }

    previousModeButton = modeButton;
    previousTeachButton = teachButton;
}

// ============================================================
// BLUEPAD32
// ============================================================

void onConnectedController(ControllerPtr controller) {
    for (int i = 0; i < BP32_MAX_GAMEPADS; i++) {
        if (controllers[i] == nullptr) {
            controllers[i] = controller;
            robot.controllerConnected = true;
            lastGamepadPacketMs = millis();

            digitalWrite(PIN_LED_BT, HIGH);

            Serial.printf(
                "Pad podłączony, slot: %d\n",
                i
            );

            return;
        }
    }
}

void onDisconnectedController(ControllerPtr controller) {
    for (int i = 0; i < BP32_MAX_GAMEPADS; i++) {
        if (controllers[i] == controller) {
            controllers[i] = nullptr;
        }
    }

    robot.controllerConnected = false;
    digitalWrite(PIN_LED_BT, LOW);

    emergencyStopMotion();

    Serial.println("Pad rozłączony");
}

ControllerPtr getActiveController() {
    for (ControllerPtr controller : controllers) {
        if (controller != nullptr &&
            controller->isConnected() &&
            controller->isGamepad()) {
            return controller;
        }
    }

    return nullptr;
}

// ============================================================
// SERWA
// ============================================================

int angleToPulseUs(
    float angleDeg,
    float minimumDeg,
    float maximumDeg,
    int minimumUs,
    int maximumUs
) {
    const float angle = clampFloat(angleDeg, minimumDeg, maximumDeg);
    const float normalized =
        (angle - minimumDeg) / (maximumDeg - minimumDeg);

    return lroundf(
        minimumUs + normalized * (maximumUs - minimumUs)
    );
}

void updateServoTargets(
    float rotateCommand,
    float gripCommand,
    float deltaTimeSeconds
) {
    robot.toolRotateDeg +=
        rotateCommand *
        TOOL_ROTATE_SPEED_DEG_S *
        deltaTimeSeconds;

    robot.gripperDeg +=
        gripCommand *
        GRIP_SPEED_DEG_S *
        deltaTimeSeconds;

    robot.toolRotateDeg = clampFloat(
        robot.toolRotateDeg,
        TOOL_ROTATE_MIN_DEG,
        TOOL_ROTATE_MAX_DEG
    );

    robot.gripperDeg = clampFloat(
        robot.gripperDeg,
        GRIP_MIN_DEG,
        GRIP_MAX_DEG
    );
}

void refreshServos() {
    const uint32_t now = millis();

    if (now - lastServoUpdateMs < SERVO_PERIOD_MS) {
        return;
    }

    lastServoUpdateMs = now;

    servoRotateFilteredDeg +=
        (robot.toolRotateDeg - servoRotateFilteredDeg) *
        SERVO_FILTER_ALPHA;

    servoGripFilteredDeg +=
        (robot.gripperDeg - servoGripFilteredDeg) *
        SERVO_FILTER_ALPHA;

    const int rotatePulseUs = angleToPulseUs(
        servoRotateFilteredDeg,
        TOOL_ROTATE_MIN_DEG,
        TOOL_ROTATE_MAX_DEG,
        SERVO_ROTATE_MIN_US,
        SERVO_ROTATE_MAX_US
    );

    const int gripPulseUs = angleToPulseUs(
        servoGripFilteredDeg,
        GRIP_MIN_DEG,
        GRIP_MAX_DEG,
        SERVO_GRIP_MIN_US,
        SERVO_GRIP_MAX_US
    );

    servoRotate.writeMicroseconds(rotatePulseUs);
    servoGrip.writeMicroseconds(gripPulseUs);
}

// ============================================================
// JOINT MODE
// ============================================================

void processJointMode(
    float axisX,
    float axisY,
    float axisZ,
    float deltaTimeSeconds
) {
    JointPosition target = robot.joints;

    target.arm1Deg +=
        axisX *
        ARM_JOG_SPEED_DEG_S *
        deltaTimeSeconds;

    // Odwrócenie Y, aby ruch drążka do góry zwiększał wartość.
    target.arm2Deg +=
        -axisY *
        ARM_JOG_SPEED_DEG_S *
        deltaTimeSeconds;

    target.zMm +=
        -axisZ *
        Z_JOG_SPEED_MM_S *
        deltaTimeSeconds;

    commandJointPosition(target);
}

// ============================================================
// TOOL MODE
// ============================================================

void processToolMode(
    float axisX,
    float axisY,
    float axisZ,
    float deltaTimeSeconds
) {
    CartesianPosition desired = robot.tcp;

    desired.xMm +=
        axisX *
        TOOL_XY_SPEED_MM_S *
        deltaTimeSeconds;

    desired.yMm +=
        -axisY *
        TOOL_XY_SPEED_MM_S *
        deltaTimeSeconds;

    desired.zMm +=
        -axisZ *
        Z_JOG_SPEED_MM_S *
        deltaTimeSeconds;

    desired.zMm =
        clampFloat(desired.zMm, Z_MIN_MM, Z_MAX_MM);

    JointPosition calculatedJoints;

    // true = wybrana konfiguracja łokcia.
    // Zmień na false, jeśli robot ma pracować w drugiej konfiguracji.
    constexpr bool ELBOW_UP = true;

    if (!inverseKinematics(
            desired.xMm,
            desired.yMm,
            ELBOW_UP,
            calculatedJoints)) {
        digitalWrite(PIN_LED_ERROR, HIGH);
        return;
    }

    calculatedJoints.zMm = desired.zMm;

    digitalWrite(PIN_LED_ERROR, LOW);

    commandJointPosition(calculatedJoints);
}

// ============================================================
// OBSŁUGA PADA
// ============================================================

void processGamepad(float deltaTimeSeconds) {
    ControllerPtr controller = getActiveController();

    if (controller == nullptr) {
        return;
    }

    // hasData() oznacza tylko, że właśnie dotarł nowy raport z pada.
    // Nie wolno od niego uzależniać wykonywania ruchu, bo raporty Bluetooth
    // przychodzą rzadziej i nierównomiernie niż pętla sterowania.
    // Ostatnie wartości osi są przechowywane przez Bluepad32 i mogą być
    // wykorzystywane w każdym cyklu sterowania.
    if (controller->hasData()) {
        lastGamepadPacketMs = millis();
    }

    const float leftX =
        normalizeJoystick(controller->axisX());

    const float leftY =
        normalizeJoystick(controller->axisY());

    const float rightX =
        normalizeJoystick(controller->axisRX());

    const float rightY =
        normalizeJoystick(controller->axisRY());

    const bool padStart =
        controller->miscStart();

    if (padStart && !previousPadStart) {
        toggleControlMode();
    }

