Attiny2313/SCARA-Robot-Controler-BT/src/main.cpp
    previousPadStart = padStart;

    float gripCommand = 0.0f;

    if (controller->a()) {
        gripCommand = 1.0f;
    }

    if (controller->b()) {
        gripCommand = -1.0f;
    }

    updateServoTargets(
        rightX,
        gripCommand,
        deltaTimeSeconds
    );

    if (robot.mode == ControlMode::JOINT) {
        processJointMode(
            leftX,
            leftY,
            rightY,
            deltaTimeSeconds
        );
    } else {
        processToolMode(
            leftX,
            leftY,
            rightY,
            deltaTimeSeconds
        );
    }
}

// ============================================================
// INICJALIZACJA SILNIKÓW
// ============================================================

bool initializeSteppers() {
    stepperEngine.init(1);

    stepperArm1 =
        stepperEngine.stepperConnectToPin(PIN_STEP_ARM1);

    stepperArm2 =
        stepperEngine.stepperConnectToPin(PIN_STEP_ARM2);

    stepperZ =
        stepperEngine.stepperConnectToPin(PIN_STEP_Z);

    if (stepperArm1 == nullptr ||
        stepperArm2 == nullptr ||
        stepperZ == nullptr) {
        return false;
    }

    stepperArm1->setDirectionPin(
        PIN_DIR_ARM1,
        true,
        200
    );

    stepperArm2->setDirectionPin(
        PIN_DIR_ARM2,
        true,
        200
    );

    stepperZ->setDirectionPin(
        PIN_DIR_Z,
        true,
        200
    );

    stepperArm1->setSpeedInHz(ARM1_MAX_STEP_HZ);
    stepperArm2->setSpeedInHz(ARM2_MAX_STEP_HZ);
    stepperZ->setSpeedInHz(Z_MAX_STEP_HZ);

    stepperArm1->setAcceleration(ARM1_ACCEL);
    stepperArm2->setAcceleration(ARM2_ACCEL);
    stepperZ->setAcceleration(Z_ACCEL);

    stepperArm1->setCurrentPosition(
        arm1DegreesToSteps(HOME_ARM1_DEG)
    );

    stepperArm2->setCurrentPosition(
        arm2DegreesToSteps(HOME_ARM2_DEG)
    );

    stepperZ->setCurrentPosition(
        zMillimetersToSteps(HOME_Z_MM)
    );

    return true;
}

// ============================================================
// SETUP
// ============================================================

void setup() {
    Serial.begin(115200);
    delay(500);

    pinMode(PIN_LED_BT, OUTPUT);
    pinMode(PIN_LED_ERROR, OUTPUT);
    pinMode(PIN_LED_STATUS, OUTPUT);

    pinMode(PIN_BUTTON_TEACH, INPUT_PULLUP);
    pinMode(PIN_BUTTON_MODE, INPUT_PULLUP);

    // GPIO39 nie ma wewnętrznego pull-up.
    // Rezystor musi być na PCB.
    pinMode(PIN_ESTOP, INPUT);

    digitalWrite(PIN_LED_BT, LOW);
    digitalWrite(PIN_LED_ERROR, LOW);
    digitalWrite(PIN_LED_STATUS, LOW);

    robot.mode = ControlMode::JOINT;
    robot.estopLatched = false;
    robot.controllerConnected = false;

    robot.joints.arm1Deg = HOME_ARM1_DEG;
    robot.joints.arm2Deg = HOME_ARM2_DEG;
    robot.joints.zMm = HOME_Z_MM;

    robot.tcp = forwardKinematics(robot.joints);

    robot.toolRotateDeg = HOME_TOOL_ROTATE_DEG;
    robot.gripperDeg = HOME_GRIP_DEG;

    servoRotate.setPeriodHertz(50);
    servoGrip.setPeriodHertz(50);

    servoRotate.attach(
        PIN_SERVO_ROTATE,
        SERVO_ROTATE_MIN_US,
        SERVO_ROTATE_MAX_US
    );

    servoGrip.attach(
        PIN_SERVO_GRIP,
        SERVO_GRIP_MIN_US,
        SERVO_GRIP_MAX_US
    );

    servoRotateFilteredDeg = robot.toolRotateDeg;
    servoGripFilteredDeg = robot.gripperDeg;

    servoRotate.writeMicroseconds(
        angleToPulseUs(
            servoRotateFilteredDeg,
            TOOL_ROTATE_MIN_DEG,
            TOOL_ROTATE_MAX_DEG,
            SERVO_ROTATE_MIN_US,
            SERVO_ROTATE_MAX_US
        )
    );

    servoGrip.writeMicroseconds(
        angleToPulseUs(
            servoGripFilteredDeg,
            GRIP_MIN_DEG,
            GRIP_MAX_DEG,
            SERVO_GRIP_MIN_US,
            SERVO_GRIP_MAX_US
        )
    );

    if (!initializeSteppers()) {
        digitalWrite(PIN_LED_ERROR, HIGH);

        Serial.println(
            "Błąd inicjalizacji FastAccelStepper"
        );

        while (true) {
            delay(1000);
        }
    }

    BP32.setup(
        &onConnectedController,
        &onDisconnectedController
    );

    // Nie wywołuj BP32.forgetBluetoothKeys() przy każdym starcie,
    // bo pad nie będzie się automatycznie ponownie łączył.

    Serial.println();
    Serial.println("Sterownik SCARA uruchomiony");
    Serial.println("Pozycja po włączeniu została uznana za HOME");

    printCurrentPosition();
}


//  
// LOOP
// ============================================================

void loop() {
    BP32.update();

    updateEmergencyStop();
    updatePanelButtons();
    refreshServos();

    const uint32_t now = millis();

    if (now - lastControlMs >= CONTROL_PERIOD_MS) {
        const float deltaTimeSeconds =
            static_cast<float>(now - lastControlMs) / 1000.0f;

        lastControlMs = now;

        if (!robot.estopLatched) {
            processGamepad(deltaTimeSeconds);
        }
    }

    if (robot.controllerConnected &&
        millis() - lastGamepadPacketMs > GAMEPAD_TIMEOUT_MS) {
        emergencyStopMotion();

        digitalWrite(PIN_LED_ERROR, HIGH);
    }

    delay(1);
}